In [1]:
import pandas as pd

In [12]:
var = pd.DataFrame({"A":[1,2,3,4,5],"B":[11,12,13,14,15]})
var

   A   B
0  1  11
1  2  12
2  3  13
3  4  14
4  5  15

In [13]:
var.insert(1,"C",var["A"])
var

   A  C   B
0  1  1  11
1  2  2  12
2  3  3  13
3  4  4  14
4  5  5  15

In [14]:
var.insert(3,"D",var["B"][:4])

In [15]:
var

   A  C   B     D
0  1  1  11  11.0
1  2  2  12  12.0
2  3  3  13  13.0
3  4  4  14  14.0
4  5  5  15   NaN

# Delete

In [16]:
var1 = var.pop("C")
var1

0    1
1    2
2    3
3    4
4    5
Name: C, dtype: int64

In [17]:
var

   A   B     D
0  1  11  11.0
1  2  12  12.0
2  3  13  13.0
3  4  14  14.0
4  5  15   NaN

In [18]:
del var["D"]
var

   A   B
0  1  11
1  2  12
2  3  13
3  4  14
4  5  15